Samples/TestBed/Chapter10/listing10.1.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<GetName xmlns="Some-URI">
			<CustomerID>ALFKI</CustomerID>
		</GetName>
	</soap:Body>
</soap:Envelope>